Autodesk.Revit.DB.Events.EventStatus
Describes the status of an action which triggered a post event.

Autodesk.Revit.DB.Events.EventStatus.Cancelled
The action that triggered this event was cancelled by an event handler from the pre-event for the action.

Autodesk.Revit.DB.Events.EventStatus.Succeeded
The action that triggered this event succeeded.

Autodesk.Revit.DB.Events.EventStatus.Failed
The action that triggered this event failed.